""" 1. Сгенерируйте с использованием функции range (случайный шаг от 3 до 5)
массив, содержащий отсортированные числа от 10 до 250 млн.
Можно использовать функцию randomint из модуля random для ещё большей
рандомизации значений, но для целей работы алгоритма бинарного поиска
проследите, чтобы значения в массиве были отсортированы.
2. Сгенерируйте с помощью list comprehensions и функции randomint
(встроенный модуль random) 10 случайных чисел.
3. Напишите функцию для алгоритма линейного поиска.
4. Напишите функцию для алгоритма бинарного поиска.
5. Проверьте наличие ранее сгенерированных случайных чисел в массиве с
помощью алгоритмов линейного и бинарного поиска, замерьте время """

